[
  {
    "path": "posts/2021-06-18-dataviz-makeover-2-blog/",
    "title": "DataViz Makeover 2",
    "description": "Visualisation of Singapore’s Yearly Merchandise Trade Volume with it’s Trade Partners",
    "author": [
      {
        "name": "Nikitha Banda",
        "url": "https://www.linkedin.com/in/banda-nikitha"
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Introduction\r\n2.0 Critic of Original Visualization2.1 Original Visualization\r\n2.2 Critic Clarity\r\n2.3 Critic Aesthetic\r\n\r\n3.0 Alternative Approach3.1 Sketch\r\n3.2 Clarity\r\n3.3 Aesthetic\r\n\r\n4.0 Proposed Visualization\r\n5.0 Building Alternative Design5.1 The Data\r\n5.2 Data Preparation Steps\r\n5.3 Charts Creation Steps\r\n\r\n6.0 Derived Insights6.1 Trade patterns with Malaysia and China\r\n6.2 Trading with United States\r\n6.3 Common Trend in 2016\r\n\r\n\r\n1.0 Introduction\r\nThis makeover is also based on merchandise trade volume of Singapore provided by Department of Statistics (DOS). The data can be found here under the sub-section “Merchandise Trade by Region/Market”.\r\nAs part of this visualization, all countries are considered and trades based in January 2011 to December 2020 are used.\r\nNote: To create the visualization in this Dataviz, Tableau and Tableau Prep Builder are required\r\n2.0 Critic of Original Visualization\r\n2.1 Original Visualization\r\nThe original visualization is as below\r\n\r\nFor a more clear and complete visualization, click here\r\n2.2 Critic Clarity\r\nTitle: The title of the data visualization does not convey the message well.\r\nThe title mentions ‘Major Trading Partner’ which does not specify if the top 10 countries were taken or if they were randomly selected.\r\nThe year mentioned in the title is 2020, however, the notes at the bottom mention years dating back to 2006 and 2009. Also, it does not show what were the months considered for analysis.\r\nThe title specifies merchandise trade performance but it is only understandable from looking at the graph that plotting is with respect to exports and imports.\r\nChart Type:\r\nSince the bubbles are not transparent, at the places where there is an overlap, it is difficult to view what are the other bubbles below. If a smaller bubble were to be completely under a much bigger bubble, then we would not be able to view the smaller bubble at all. This is a very big limitation.\r\nAxis:\r\nPlacing the axis labels at the origin is a bit confusing. Instead the labels could have been at the centre of each axis making it clearer.\r\nThe unit of the axis is also not provided.\r\nTooltip:\r\nThe tooltips are static and when we hover over a bubble, there is no additional information other than the bubble bouncing.\r\nThere is some overspill in the graph due to these static tooltips.\r\nThe only information provided per bubble is the total trade and it is difficult to interpret what might be the import and export values for each bubble respectively.\r\nAnimation:\r\nIt shows that Hong Kong and Taiwan are top net exporter and importers respectively. However, the chart does not show it like that. China seems to be the top in both aspects.\r\n2.3 Critic Aesthetic\r\nChart Type:\r\nMultiple colour usage for bubbles is not required since all the countries are plotted against the same axis.\r\nAlso, since the bubbles are not transparent, we cannot see if some of the white dots are falling on the exports or imports side.\r\nAxis:\r\nUsing two colour pallets for the background of the graph is not required and also it as no use in this case.\r\nAbsence of major and minor tick marks on both the axis even though the data is continuous.\r\nAnimations: There is unnecessary animation usage in this graph. Animations should have meaning then only it will be useful else not.\r\nAll animations used to represent imports and exports for the label of the axis is not required. Using unnecessary animations does not make the graph look good but rather diverts the attention of the user.\r\nThe bouncing of the bubble when the mouse is hovered over it is not required as it provides no additional information.\r\n3.0 Alternative Approach\r\n3.1 Sketch\r\n\r\n3.2 Clarity\r\nTitle: The title and subtitle explain the keywords and definitions that will be used in the graph.\r\nThe title now states the number of countries plotted in the graph and also the year and months that are included for the analysis.\r\nAdditionally, the title changes as the user performs any filter. The subtitle further mentions the counties that are plotted.\r\nInstead of using ‘Performance’, ‘Export’ and ‘Import’ terms are used to describe the graph accurately.\r\nChart Type:\r\nThe bubbles are given transparency so as to view any overlapping bubbles.\r\nInstead of using colour for the chart in the background to differentiate exports and imports, reference lines were used to form 4 quadrants and annotations were put in place and labelled accordingly.\r\nAxis:\r\nThe label of axis is placed in the centre to make it clearer and also unit sign ($) is introduced.\r\nThe axis does not begin with zero and this helps to enlarge the view of bubbles and also prevents major overlapping as most of the countries happen fall in the quadrant with low import and export. Therefore, avoiding starting with zero will prevent all closely plotted bubble from overlapping.\r\nTooltip:\r\nThe tooltips added give additional information then what is shown in the plot. Whenever a user hovers over a bubble, he can view the value of exports, imports, total trade and the rank of exports and imports for that country. Additionally, the trend of merchandise trade over the years can also be viewed as a bar plot.\r\nSince the tooltips are not static, there is no overspill of the graph.\r\n3.3 Aesthetic\r\nChart Type:\r\nOnly one colour scheme is used for the bubbles. Darker meaning that the value of trade is more and lighter meaning the trade value is small. The same implies for size as well.\r\nAxis:\r\nMajor and minor tick marks on both the axis are introduced. The interval for minor marks is set such that there is no overcrowding in the axis.\r\nAnimation:\r\nAnimation is used to provide seamless movement of bubbles when a user filters based on year or country. This seamless motion helps the user to watch the bubble as they move without breaks.\r\n4.0 Proposed Visualization\r\nThe alternate proposed visualization is as follows:\r\n\r\nIt can be viewed here on Tableau Public.\r\n5.0 Building Alternative Design\r\nFollow below steps to prepare the above visualization:\r\n5.1 The Data\r\nDownload the data from Statistics Singapore website and extract the file. It will be in ‘.xlsx’ format. There will be two sheets present within the excel file. Sheet ‘T1’ is data on imports and ‘T2’ is data on exports. Below is a snapshot of how the raw data looks like.\r\n\r\n5.2 Data Preparation Steps\r\nAs part of data preprocessing, Tableau Prep Builder was used. This platform was choosen because it is easy and quick to work on.\r\nStep 1: Open the Prep Builder and drag and drop the file into it. The builder will then open up a flow workspace where we can work on processing the data.\r\n\r\nStep 2: Drag and drop ‘T1’ and ‘T2’ in the work space as shown.\r\n\r\nStep 3: Rename ‘T1’ and ‘T2’ to ‘import’ and ‘export’ respectively. Also, select the ‘Use Data Interpreter’ and click on view and clean data for ‘import’ and ‘export’.\r\n\r\nStep 4: Next, click on ‘Clean 1’. To retain only the country names from ‘Variables’ column, right click on “Variables” and select split -> Custom Split and split the records at ‘(’. Then click on “Split” button.\r\n\r\nStep 5: Then rename the new generated column to ‘Country’. Repeat step 4 and 5 for ‘Clean 2’.\r\n\r\nStep 6: Right click on ‘Country’ under ‘Clean 1’ and select ‘Selected Values’ filter and exclude all non Countries and Total trade observation records as shown. Repeat the same for ‘Clean 2’\r\n\r\nStep 7: Add pivot nodes to Clean 1 and 2. Select all the months fields and drop them into “Pivoted Fields”. Delete “Variables” field. Repeat same for Pivot 2.\r\n\r\nStep 8: Under Pivot 1, rename ‘Pivot1 Names’ to ‘Month’ and change data type to ‘Date’. Rename ‘Pivot1 Values’ to ‘Import (Thousand Dollars)’. Repeat for ‘Pivot 2’ but rename ‘Pivot2 Values’ to ‘Export (Thousand Dollars)’.\r\n\r\nStep 9: Add a join after ‘Pivot 1’ and drag the ‘Pivot 2’ and drop it under “Add” as shown below.\r\n\r\nStep 10: Change the join type to full and match with ‘Country’ and ‘Month’ as the join clauses.\r\n\r\nStep 11: Add a ‘Clean’ node after ‘Join 1’ to merge all the duplicate columns and remove unnecessary dates.\r\n\r\nStep 12: Create a ‘Output’ node after ‘Clean 3’ and save output as “Singapore Monthly Merchandise Trade_Exports&Imports” and run the flow. This will save the \".hyper. file in the specified location.\r\n\r\nStep 13: Add a ‘Pivot’ node after ‘Clean 3’ and drag and drop ‘Export (Thousand Dollars)’ and ‘Import (Thousand Dollars)’ into “Pivoted Fields”. Split ‘Pivot1 Names’ and rename the generated field to ‘Trade Type’. Next, multiply variable ‘(Thousand Dollars)’ by 1000 and rename it ‘Trade Value’. Remove the unnecessary fields ‘(Thousand Dollars)’ and ‘Pivot1 Names’. Also, filter the dates just like in Step 11.\r\n\r\nStep 14: Create another ‘Output’ node after ‘Pivot 3’ node and save output as ‘Singapore Monthly Merchandise Trade’and run the flow. This will save the \".hyper. file in the specified location.\r\n\r\nAfter performing the above steps, we should be having two \".hyper files with us. One with exports and imports separated and another combined.\r\n5.3 Charts Creation Steps\r\nAll following steps ae performed in Tableau.\r\nPlotting the graph:\r\nStep 1: Open Tableau and drag and drop both the ‘.hyper’ files to create a connection. Under ‘Singapore Monthly Merchandise Trade_Exports&Imports’, create a calculated field for ‘Export (Thousand Dollars)’ and multiply it by 1000. Rename the newly created field to ‘Export. Repeat the same for ’Import (Thousand Dollars)’ and rename the field to ‘Import’. After this, hide the ‘Thousand Dollars’ fields from all further analysis. Match country with country and month with month to combin the two files as show below.\r\n\r\nStep 2: For chart 1, open a new worksheet and name it as ‘Bubble Plot’. Drag and drop ‘Export’ and ‘Import’ into roes and columns respectively. By default, Tableau aggregates all data as total of ‘Export’ and ‘Import’. Therefore, in order to make it understand to plot the scatter plot by countries, we need to drop ‘Country’ field into detail.\r\n\r\nStep 3: Next, drag and drop ‘Trade Value’ into color and size so that the darkness of the color and size of each bubble plot will be according to how big or small the trade value is. Change the graph to circle and edit the color and introduce border and transparency to the bubbles. This is so as to view any overlapping bubbles that me be there in the plot.\r\n\r\nStep 4: For nulls that exist, click on the nulls and select ‘Filter Data’. This will not include nulls for all further analysis.\r\n\r\nFilter: Since the data is very vast including trades from 2011 to 2020, providing interactivity to the user by allowing him to select the year he wants to analyze and the countries he wants to view will help narrow down and understand the analysis even more. This is where filters come in picture. They provide intractability to the user. In out case, the user can be provided options to select year and the countries he wants to analyze on.\r\nStep 5: To add filter on year, drag and drop ‘Month’ into filter and select year and by default set the year selection to 2020. This will enable default view of the plot to be based on 2020 data only.\r\n\r\nStep 6: To provide a filter by country, drag and drop country into filter and select all countries under ‘General’ tab. This will allow all countries to be analyzed. Next, go to ‘top’ and add a parameter and name it ‘Top Countries’. Set the default value to be 10 and update the maximun value to the number of countries there are. Then click on ‘Ok’. Change the field to ‘Trade Value’. This will enable the filter to display only the top 10 highest trade value countries. Switch back to th general tab and select ‘Use All’.\r\n\r\nStep 7: Right click on countries filter and select ‘Show Filter’. This will display the filter to wards the right of the dashboard. Repeat the same for ‘Month’ filter and the new parameter created that is located at the bottom left of the page.\r\n\r\nStep 8: Hide unnecessary cards and change the selection criteria of country and month to ‘Multiple Valus(dropdown)’ and ‘Single Value(dropdown)’. Also, change the parameter selection to ‘Type In’. Performing these steps will enable the user to better understand the type of filers that are there.\r\n\r\nAxis: Formatting the axis is an important as it is from the axis that we understand the type of data we are dealing with.\r\nStep 9: Right click on the x axis and select edit axis. Under general tab,edit the title of the axis to include the units. Under tick marks tab, use fixed number of ticks rather than automatic so as to not over populate the axis and set the interval. After this, right click on the axis again and this time select format. Under axis tab, change the color of the ticks to black so that the tick marks will be visible. Repeat the same steps for y axis.\r\n\r\nStep 10: For the second chart, create a new work sheet and name it ‘Yearly Trade’. Drag ‘Country’ and ‘Month’ to ‘Columns’ and ‘Trade Value’ to ‘Rows’. Under ‘Marks’, select ‘Bar’ and drag and drop ‘Trade Type’ to ‘Color’. Drag ‘Trade Value’ to ‘Label’ and add ‘Quick Table Calculation’ to add the ‘Percent of Total’ computed using ‘Cell’. Then drag ‘Trade Value’ to label again.\r\n\r\nStep 11: Click on the Y-axis and add a reference line using the value of ‘SUM(Trade Value)’ at ‘Per Cell’ level. Remove the line.\r\n\r\nStep 12: Format the trade values shown using ‘Currency (Custom)’ with ‘Billions (B)’ as display unit at 1 decimal place. Then, hide the worksheet.\r\n\r\nTooltip: Rather than showing all details on the plot, it is better to use the toolkit. This will reduce the clutter in the graph and also improves intractability of the user.\r\nStep 13: Create a new calculated field and name it as ‘Ranking by Export’. Use the below formula and click on ‘Ok’. This calculated filed will denote the rank of the exports of that country in the toolkit. This enables easy readability to the user. Repeat the same for imports and name the calculated field as ‘Ranking by Import’.\r\n\r\nStep 14: By default, the ranking will be based on computation of the whole table. So specify that the ranking must be based on country. To perform this, click on the arrow beside ‘Ranking by Export’ and under compute using, select country. Repeat the same for import.\r\n\r\nStep 15: Format the import axis by changing its text color with respect to the color of exports in chart 2 and also under pane, change the number format to currency as shown below. Repeat this step for export axis.\r\n\r\nStep 16: Format the toolkit by clicking on toolkit and formatting the text as shown. Additionally, add the ‘Yearly Trade’ sheet to the toolkit. This will provide the user to look at the trend of trade for that country over the years. The main idea of this step is to improve the user understadability of the analysis.\r\n\r\nFinal Touches:\r\nStep 17: Add a reference line to x axis. Set the value to be average of sum of imports and chose the line to be dotted and a dark gray color. This is done so as to elevate the reference line from the axis in the background. After that, format the reference line and change the value as below. Repeat the same for y axis\r\n\r\nStep 18: Right click on the plot and select annotate area. Use these annotations to display the level of export and import such as high and low on the four quadrants formed by the reference lines.\r\n\r\nStep 19: Edit the title to a meaningful one. Since our charts are interactive, there value need to change as and when the user filters values. Therefore, we need to insert the parameter values and other filters into the title so that the title changes as the filters change.\r\n\r\nStep 20: Lastly, since the data visualized is year based and the user can select the year he wants to analyze, whenever the user changes the year, it is better if there is an animation involved. This enables the movement of the bubbles to be seamless without any breaks and helps improve user experience. Under ‘Format’, select ‘Animation’ and by default it will be off. Change ‘On’ and adjust the duration accordingly.\r\n\r\n6.0 Derived Insights\r\n6.1 Trade patterns with Malaysia and China\r\nMalaysia had the highest total trade for the years 2011 and 2012. However, in 2013, China had $0.57 Billion more trade value than Malaysia and attained the highest trade value. Also in that year, the rank of imports and exports with China was 1 and 2 and with Malaysia was 2 and 1 respectively. Following year 2013, China has been the top most trading partner with Singapore for both imports and exports.\r\n\r\n6.2 Trading with United States\r\nFrom 2011 to 2017, US has always fallen in the quadrant that is “High Import” “Low Export”.It’s exports percentage was always below 42% before 2018 with the highest total trade being $79.9B recorded in 2017. However, since 2018, this trend has changed and the US now falls under “High Imports” “High Exports” quadrant. This is due to the increase in the value of exports with their country. Since 2018, there has been a steady increase in exports with the US and in 2020, the value of exports even over took the value of imports by $5.7B. Another interesting insight is that US has always been among the top 3 from 2011 to 2020.\r\n\r\n6.3 Common Trend in 2016\r\nA common trend can be seen among countries for the year 2016. There was a decrease in total trade for majority of the countries. This could be explain by the series of events that took place in 2016. The sharpest fall was recorded in trade with China where the total trade decreased from $128.6B to $117.2B. Majority of this drop is due to exports that reduced to $61.3B from $70.7B\r\n\r\nThe Economic Times, 2016\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T20:16:32+08:00",
    "input_file": "dataviz-makeover-2-blog.knit.md"
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover-1-blog/",
    "title": "DataViz Makeover 1",
    "description": "This blog consists of DataViz Makeover 1 for ISSS608: Visual Analytics!",
    "author": [
      {
        "name": "Nikitha Banda",
        "url": "https://www.linkedin.com/in/banda-nikitha"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1.0 Critic of Visualization\r\n1.1 Original Visualization\r\nThe original visualization is as below\r\n\r\n1.2 Critic Clarity\r\nThe title partially conveys the intent of the graph. In this case, the graph is showing 2021 in most of the chart’s x-axis however, the title says 2019 to 2020 and also the title mentions top 6 but we are not sure of the ranking of these 6 countries based on the graph provided.\r\nSince the data is monthly, the title should also have mentioned the month of 2019 to month of 2020 included in the analysis (ie Jan 2019-Dec2020).\r\nThe uneven y-axis scale for exports makes it difficult to compare one country with other countries just by looking as their scales are different. Same applies for imports.\r\nFor country “Japan”, the x axis only has 2020 which is inconsistent from the other countries plotting.\r\nExisting title only mentions Merchandise trade but does not specify trade with which country.\r\n1.3 Critic Aesthetic\r\nTick marks are absent on the x axis even though the data is continuous and this makes it difficult to identify which year/month is the corresponding reading from.\r\nThe representation of graph is very poor. The overlap of the exports and imports resulted in another colour and this is making it difficult to interpret if one is looking at the “import” segment or the “export” segment.\r\nSize of each chart on the graph is different that resulted in uneven x-axis scale among different countries.\r\nThe title is centralized however the country name for each chart respectively did not follow this indentation instead they are towards the left of each chart.\r\nAbsence of major and minor tick marks on both y-axis’s even though the data is continuous.\r\n2.0 Alternative Approach\r\n2.1 Sketch\r\n\r\n2.2 Clarity\r\nThe title and subtitle explain the keywords and definitions that will be used in the graph. The sum of imports and exports for each of the six countries is additionally calculated so as to sort the countries in the descending order of total trade.\r\nScale on y-axis for exports among all countries is transformed to be same so as to make the comparison easier between countries. Same applies for imports as well.\r\nOnly one x-axis is used across all countries maintaining consistency and also reducing redundancy of scale in the overall graph.\r\nUpon looking into the data it is understandable that the data is based on trading with Singapore. This is mentioned in the title to make it more clear.\r\n2.3 Aesthetic\r\nMajor tick marks are added to the x-axis and the number of major ticks has been increased to 1 tick for every 2 months so as to prevent intensity on the axis.\r\nSince the axis for exports and imports is different, graphs are represented differently too. Bar plot is used for exports and line graph is used for imports. Colours are used to bring attention to different categories.\r\nArea of graph for each country is maintained the same to prevent mismatching of scales on axis and misconceptions.\r\nThe title is aligned with the ordered list of country names. (i.e. both are aligned towards the left)\r\nMajor and minor tick marks are used on the y-axis for numerical continuous data.\r\n3.0 Proposed Visualization\r\nThe alternative proposed visualization can be viewed here on Tableau Public.\r\n4.0 Static Tableau step-by-step description\r\nStep 1: Select only the data table imports and paste into a new sheet using Microsoft Excel and save the file as “imports_clean”. Repeat the same for exports and save it into a new excel file called “exports_clean”\r\n\r\nStep 2: Import “imports_clean” into Tableau and rename “Variables” to “Country”\r\n\r\nStep 3: Use Tableau to select only the dates from Jan 2019 to Dec 2020\r\n\r\nStep 4: Remove CNT in measured values\r\n\r\nStep 5: Apply filter on Country by right clicking on the axis and selecting filter and select only the 6 countries\r\n\r\nStep 6: View data in Tableau, export the data and save the file as “imports2019-20”\r\n\r\nStep 7: Repeat step 2 to 6 for “exports_clean” and save it as “exports2019-20”\r\nStep 8: Import the exported files into Tableau and pivot all the date columns and rename the pivoted columns into their suitable names. Then join the two files based on the shown relationship\r\n\r\nStep 9: Put measured values in columns and country into rows and remove CNT from measured values\r\n\r\nStep 10: Export the view data analysis and save it as “total.csv”\r\n\r\nStep 11: Rearrange imports and exports such that they are side by side and apply below formula in excel to calculate the sum of imports and exports for each country. This step helps in finding the rank of each country\r\n\r\nStep 12: Import the exported files into Tableau and pivot all the date columns and rename the pivoted columns into their suitable names and change the data type of year/month to date\r\n\r\nStep 13: Merge exported csv files with the following relationships between ‘imports and exports’ and ‘total and exports’ as shown in the figure below\r\n\r\nStep 14: Add year/month to columns and “country”, “exports” and “imports” to row\r\n\r\nStep 15: By default the graphs are represented as scatter plot. Change the plot to bar and line for exports and imports respectively\r\n\r\nStep 16: Formatting y-axis->\r\nRight click on exports axis and select format and change the color of the axis to match with the bar plot. Repeat the same for imports to match with line graph color\r\n\r\nThe name of countries consists of (Thousand Dollars). Right click on the name and select edit alias to change the name\r\n\r\nRight click on exports and edit the axis as shown in the images to introduce ticks to the axis as it is continuous\r\n\r\nFor the tick marks to be visible, format the axis and change color to black as shown in the figure. Repeat the same for imports axis\r\n\r\nAfter performing the above steps, the graph now looks like:\r\n\r\nStep 17: Formatting x-axis->\r\nChange the data type of Year/month to continious\r\n\r\nRight click on the axis again and select edit axis to introduce tick marks on the axis as it is continuous data and also remove the title Year/month as it is no longer required\r\n\r\nTo make the tick marks visible, right click on the axis select format and change color to black and also change the format of date into “mmm yy” to make it more readable\r\n\r\nAfter performing the above steps, the graph now looks like:\r\n\r\nStep 18: Now to rank the countries in descending order of their trade values, right click on country and select sort and sort the variable based on field name “Total” as shown below. Double click on the title to give the graph a valid name and rename the legend title to “Legend” instead of “Measure Names”\r\n\r\nStep 19: Lastly, for better understanding of the information, edit the tool kit and the currency representation by editing exports and imports as below\r\n\r\nThe final graph now looks like:\r\n\r\n5.0 Derived Insights\r\n5.1 High Level Observations\r\nHong Kong is the only county with which Singapore has greater exports than imports. However, it is Japan that has lower total trading value than Hong Kong with Singapore. In contrast, the country that has the highest trading is China both in terms of total exports and total imports respectively.\r\n\r\n5.2 Comparing with Covid19 Trend\r\nFeb 2020 was the month with least exports and imports between China and Singapore. Also, it is notable that there is a steep drop in both exports and imports between China from Dec 2019 to Feb 2020. This could be explained by the first confirmed covid19 case in China.\r\n\r\nThinkChina, 2021\r\n5.3 Observation during Circuit Breaker period\r\nAnother trend that is visible is when Singapore announced circuit breaker measures. It is visible from the graph below that there was significant drop in imports and exports during the months of March 2020 to May 2020 which was when circuit breaker was introduced.\r\n\r\nMinistry of Trade and Industry, 2020\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T17:35:28+08:00",
    "input_file": "dataviz-makeover-1-blog.knit.md"
  }
]
